app/controllers/packages_controller.rb

SELECT  "packages".* FROM "packages" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "packages"
---
  def index
    @packages = Package.paginate(page: params[:page])

SELECT  "packages".* FROM "packages" WHERE "packages"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def show
    @package = Package.find(params[:id])